v2006/overPimpleDyMFoam/background/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
1116713
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    minX
    {
        type            zeroGradient;
    }
    maxX
    {
        type            zeroGradient;
    }
    minY
    {
        type            zeroGradient;
    }
    maxY
    {
        type            zeroGradient;
    }
    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            zeroGradient;
    }
    overset
    {
        type            overset;
        value           uniform 1;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
